# a = 5
#
# while a >= 0:
#     print("a = " + str(a))
#
#     a -= 1
#
# a = 5
########################################
# while a <= 20:
#     print("a = " + str(a))
#
#     a += 1

########################################
#
# a = 0
#
# while a < 10:
#     print(a)
#     a += 1  # ако го няма това добавяне става безкраен цикъл

# със стринг:
# word = 'Stop'
# while word != 'test':
#     print(word) # безкраен цикъл

###########################

a = 3
while True:
    if a > 10:

        break

    print('a = ' + str (a) )
    a += 1


